"""
6.1. Разберите свой код, и сделайте пять примеров, где можно более наглядно учесть в именах переменных уровни абстракции.
result -> prediction
ss -> sec_struct_string
chain_list -> chain_coms_list
angle -> calced_angle
sum -> nucleotide_sum


6.2. Приведите четыре примера, где вы в качестве имён переменных использовали или могли бы использовать технические термины из информатики.
sequence_list
config_dict
nucleobase_set
chain_array


6.3. Придумайте или найдите в своём коде три примера, когда имена переменных даны с учётом контекста (функции, метода, класса).
single_chain_angles
residue_to_process
loss_to_determine

6.4. Найдите пять имён переменных в своём коде, длины которых не укладываются в 8-20 символов, и исправьте, чтобы они укладывались в данный диапазон.
не смогла найти настолько длиинных имен
"""
